{
  "russian": {
    "hi": "Добро пожаловать в FaceEdit! Выберите интересующий раздел:",
    "desc": "Описание",
    "com_list": "Список команд",
    "inp_choice_text": "Введите текстовое описание результата редактирования изображения. Доступные параметры для изменения: цвет волос (светлый, темный, коричневый); возраст (старый или молодой); пол (мужской или женский). \nПараметры по умолчанию: темные волосы, молодой, женщина",
    "load_img": "Загрузите изображение, содержащее лицо. Лицо на изображении должно занимать не менее 50% от всего изображения.",
    "process_error": "Загрузите изображение для обработки!",
    "dark_hair": "Темные волосы",
    "fair_hair": "Светлые волосы",
    "brown_hair": "Каштановые волосы",
    "sex_w": "Женский пол",
    "sex_m": "Мужской пол",
    "age_old": "Старый",
    "age_young": "Молодой",
    "input_choice_attrs": "Выберите параметры результата редактирования изображения:",
    "desc_mes": "Данный чат-бот предназначен для осуществления семантического редактирования лица. Благодаря ему можно изменять следующие параметры: цвет волос, возраст и пол человека. Для этого необходимо сначала загрузить изображения для редактирования. Затем выбрать способ ввода описания желаемого результата редактирования изображения. Это может быть текстовое описание результата или же выбор параметров редактирования из предложенных. Для запуска процесса редактирования используйте функцию /process",
    "now_param": "Текущие параметры обработанного изображения:",
    "hair_color": "Цвет волос: ",
    "sex": "Пол: ",
    "age": "Возраст: ",
    "com_list_mes": "/start – позволяет изменить язык интерфейса\n/input_choice_text – позволяет ввести текстовое описание изменяемых параметров изображения \n/input_choice_attrs – позволяет выбрать список параметров результата обработки изображения \n/load_image – загружает изображение для обработки\n/process – запускает процесс обработки изображения"
  },
  "english": {
    "hi": "Welcome to Face Edit! Select the section you are interested in:",
    "desc": "Description",
    "com_list": "List of commands",
    "inp_choice_text": "Enter a text description of the image editing result. Available parameters to change: hair color (light, dark, brown); age (old or young); gender (male or female). Default parameters: dark hair, young, female",
    "load_img": "Upload an image containing a face. The face in the image must occupy at least 50% of the entire image.",
    "process_error": "Upload an image for processing!",
    "dark_hair": "Dark hair",
    "fair_hair": "Fair hair",
    "brown_hair": "Brown hair",
    "sex_w": "Female",
    "sex_m": "Male",
    "age_old": "Old",
    "age_young": "Young",
    "input_choice_attrs": "Select the parameters of the image editing result:",
    "desc_mes": "This chatbot is designed for semantic face editing. Thanks to it, you can change the following parameters: hair color, age and gender of a person. To do this, you must first upload the images for editing. Then choose a way to enter a description of the desired image editing result. This can be a text description of the result or a selection of editing parameters from the suggested ones. To start the editing process, use the /process function",
    "now_param": "Current parameters of the result image:",
    "hair_color": "Hair color: ",
    "sex": "Sex: ",
    "age": "Age: ",
    "com_list_mes": "/start – allows you to change the language\n/input_choice_text – allows you to enter a text description of the image parameters to be changed \n/input_choice_attrs – allows you to select a list of parameters of the image processing result\n/load_image – loads the image for processing\n/process – starts the image processing process"
  }
}